app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def create
  @recipe = Recipe.new(params[:recipe])
  if @recipe.save
---
INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-02-07 12:24:33', 'Chunky Bacon Butty', 'Toast bread, grill bacon, butter toast, add HP sauce

	def edit
		    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def update
    @recipe = Recipe.find(params[:id])
		if 	@recipe.update_attributes(params[:recipe])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 5)
UPDATE "recipes" SET "updated_at" = '2011-02-07 11:38:00', "title" = 'test rfgrfedgggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg' WHERE "id" = 10

	def destroy
	  @recipe = Recipe.find(params[:id])
		@recipe.destroy
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 5)
DELETE FROM "recipes" WHERE "id" = 5